Scenarios/Statique/openfoam/Statique_openfoam_next_iteration/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 4.696e-05;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 4.696e-05;
    }
    outlet
    {
        type            calculated;
        value           uniform 4.696e-05;
    }
    walls
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    rods
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
}


// ************************************************************************* //
